99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_byte_source.c
#include "utils/esp32_mquickjs_byte_source.h"
#include "esp32_mquickjs_memory.h"

#include <limits.h>
#include <math.h>
#include <string.h>

#include "esp_heap_caps.h"

#define ESP32_MQUICKJS_BYTE_SPAN_SOURCE_OWNER_KEY "__esp32qjsByteSpanSourceOwner"
typedef struct {
    const uint8_t *data;
    size_t length;
    esp32_mquickjs_byte_view_release_fn release;
    void *release_opaque;
    uint16_t read_leases;
    bool closed;
} esp32_mquickjs_byte_view_t;

typedef struct {
    const esp32_mquickjs_byte_span_source_object_ops_t *ops;
    void *opaque;
    uint16_t read_leases;
    bool closed;
} esp32_mquickjs_byte_span_source_object_t;

typedef struct {
    esp32_mquickjs_byte_span_source_t inner;
    esp32_mquickjs_byte_span_source_object_t *owner;
    JSGCRef owner_ref;
    bool owner_rooted;
} esp32_mquickjs_leased_byte_span_source_t;

static bool leased_byte_span_source_next(
    JSContext *ctx,
    void *opaque,
    esp32_mquickjs_byte_span_t *span)
{
    esp32_mquickjs_leased_byte_span_source_t *source = opaque;

    return source != NULL &&
           esp32_mquickjs_byte_span_source_next(ctx, &source->inner, span);
}

static void leased_byte_span_source_close(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_leased_byte_span_source_t *source = opaque;

    if (source == NULL) {
        return;
    }
    esp32_mquickjs_byte_span_source_close(ctx, &source->inner);
    if (source->owner != NULL && source->owner->read_leases > 0) {
        source->owner->read_leases--;
    }
    if (source->owner_rooted) {
        JS_DeleteGCRef(ctx, &source->owner_ref);
    }
    heap_caps_free(source);
}

static bool js_value_to_u32(JSContext *ctx, JSValue value, uint32_t *out_value)
{
    double number;

    /* Array lengths and bytes must not undergo ToInt32 truncation/wraparound.
     * Keep the existing signed array-length limit used by MQuickJS. */
    if (!JS_IsNumber(ctx, value) || JS_ToNumber(ctx, &number, value) != 0 ||
        !isfinite(number) || number < 0 || number > INT32_MAX ||
        (double)(uint32_t)number != number) {
        return false;
    }
    *out_value = (uint32_t)number;
    return true;
}

static bool js_value_to_i32(JSContext *ctx, JSValue value, int32_t *out_value)
{
    int raw_value = 0;

    if (JS_ToInt32(ctx, &raw_value, value) != 0) {
        return false;
    }
    *out_value = (int32_t)raw_value;
    return true;
}

static esp32_mquickjs_byte_view_t *byte_view_from_value(JSContext *ctx,
                                                        JSValue value,
                                                        const char *api_name)
{
    esp32_mquickjs_byte_view_t *view;

    if (JS_GetClassID(ctx, value) != JS_CLASS_BYTE_VIEW) {
        JS_ThrowTypeError(ctx, "%s expects a ByteView", api_name);
        return NULL;
    }
    view = JS_GetOpaque(ctx, value);
    if (view == NULL || view->closed) {
        JS_ThrowReferenceError(ctx, "%s failed because the ByteView is closed", api_name);
        return NULL;
    }
    return view;
}

static esp32_mquickjs_byte_span_source_object_t *byte_span_source_from_value(JSContext *ctx,
                                                                            JSValue value,
                                                                            const char *api_name)
{
    esp32_mquickjs_byte_span_source_object_t *source;
    int class_id = JS_GetClassID(ctx, value);

    if (class_id != JS_CLASS_BYTE_SPAN_SOURCE && class_id != JS_CLASS_BITMAP_SPAN_SOURCE) {
        JS_ThrowTypeError(ctx, "%s expects a ByteSpanSource", api_name);
        return NULL;
    }
    source = JS_GetOpaque(ctx, value);
    if (source == NULL || source->closed) {
        JS_ThrowReferenceError(ctx, "%s failed because the ByteSpanSource is closed", api_name);
        return NULL;
    }
    return source;
}

static void byte_view_release(esp32_mquickjs_byte_view_t *view)
{
    esp32_mquickjs_byte_view_release_fn release;
    void *release_opaque;

    if (view == NULL) {
        return;
    }
    release = view->release;
    release_opaque = view->release_opaque;
    view->release = NULL;
    view->release_opaque = NULL;
    view->data = NULL;
    view->length = 0;
    view->closed = true;
    if (release != NULL) {
        release(release_opaque);
    }
}

static JSValue byte_view_make(JSContext *ctx,
                              const uint8_t *data,
                              size_t length,
                              esp32_mquickjs_byte_view_release_fn release,
                              void *release_opaque)
{
    JSGCRef object_ref;
    JSValue *object;
    esp32_mquickjs_byte_view_t *view;

    object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_UNDEFINED;
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_BYTE_VIEW);
    if (JS_IsException(*object)) {
        JS_PopGCRef(ctx, &object_ref);
        if (release != NULL) {
            release(release_opaque);
        }
        return JS_EXCEPTION;
    }

    view = heap_caps_malloc(sizeof(*view), MALLOC_CAP_8BIT);
    if (view == NULL) {
        JS_PopGCRef(ctx, &object_ref);
        if (release != NULL) {
            release(release_opaque);
        }
        return JS_ThrowOutOfMemory(ctx);
    }
    view->data = data;
    view->length = length;
    view->release = release;
    view->release_opaque = release_opaque;
    view->read_leases = 0;
    view->closed = false;
    JS_SetOpaque(ctx, *object, view);
    return JS_PopGCRef(ctx, &object_ref);
}

static bool js_value_to_array_bytes(JSContext *ctx,
                                    JSValue *value,
                                    const char *api_name,
                                    esp32_mquickjs_byte_source_t *out,
                                    uint8_t **out_owned,
                                    JSValue *out_error)
{
    JSGCRef length_ref;
    JSValue *length_value;
    uint32_t length = 0;
    uint8_t *bytes;
    uint32_t i;

    if (JS_GetClassID(ctx, *value) < 0) {
        *out_error = JS_ThrowTypeError(ctx, "%s expects an array-like object of byte values", api_name);
        return false;
    }

    length_value = JS_PushGCRef(ctx, &length_ref);
    *length_value = JS_GetPropertyStr(ctx, *value, "length");
    if (JS_IsException(*length_value) || !js_value_to_u32(ctx, *length_value, &length)) {
        JS_PopGCRef(ctx, &length_ref);
        *out_error = JS_ThrowTypeError(ctx, "%s expects an array-like object with a numeric length", api_name);
        return false;
    }
    JS_PopGCRef(ctx, &length_ref);

    if (length == 0) {
        out->data = NULL;
        out->length = 0;
        out->owner = *value;
        *out_owned = NULL;
        return true;
    }

    bytes = heap_caps_malloc(length, MALLOC_CAP_8BIT);
    if (bytes == NULL) {
        *out_error = JS_ThrowOutOfMemory(ctx);
        return false;
    }

    for (i = 0; i < length; ++i) {
        JSGCRef item_ref;
        JSValue *item = JS_PushGCRef(ctx, &item_ref);
        uint32_t raw_byte = 0;

