99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_byte_source.c
        *item = JS_GetPropertyUint32(ctx, *value, i);
        if (JS_IsException(*item) || !js_value_to_u32(ctx, *item, &raw_byte) || raw_byte > 0xffU) {
            JS_PopGCRef(ctx, &item_ref);
            heap_caps_free(bytes);
            *out_error = JS_ThrowTypeError(ctx, "%s expects byte values in the range 0-255", api_name);
            return false;
        }
        bytes[i] = (uint8_t)raw_byte;
        JS_PopGCRef(ctx, &item_ref);
    }

    out->data = bytes;
    out->length = length;
    out->owner = *value;
    *out_owned = bytes;
    return true;
}

bool esp32_mquickjs_get_byte_source(JSContext *ctx,
                                    JSValue value,
                                    const char *api_name,
                                    esp32_mquickjs_byte_source_t *out,
                                    uint8_t **out_owned,
                                    JSValue *out_error)
{
    JSGCRef value_ref;
    JSValue *rooted_value;
    esp32_mquickjs_byte_view_t *view;
    bool result;

    if (out == NULL || out_owned == NULL || out_error == NULL) {
        return false;
    }
    out->data = NULL;
    out->length = 0;
    out->owner = JS_UNDEFINED;
    *out_owned = NULL;
    *out_error = JS_UNDEFINED;

    rooted_value = JS_PushGCRef(ctx, &value_ref);
    *rooted_value = value;
    if (JS_GetClassID(ctx, *rooted_value) == JS_CLASS_BYTE_VIEW) {
        view = byte_view_from_value(ctx, *rooted_value, api_name);
        if (view == NULL) {
            *out_error = JS_EXCEPTION;
            result = false;
        } else {
            out->data = view->data;
            out->length = view->length;
            out->owner = *rooted_value;
            result = true;
        }
    } else {
        result = js_value_to_array_bytes(ctx, rooted_value, api_name, out, out_owned, out_error);
    }
    JS_PopGCRef(ctx, &value_ref);
    return result;
}

bool esp32_mquickjs_get_byte_source_array_length(JSContext *ctx,
                                                 JSValue value,
                                                 const char *api_name,
                                                 uint32_t *out_length,
                                                 JSValue *out_error)
{
    JSGCRef length_ref;
    JSValue *length_value;

    if (out_length == NULL || out_error == NULL) {
        return false;
    }
    *out_length = 0;
    *out_error = JS_UNDEFINED;

    if (JS_GetClassID(ctx, value) < 0) {
        *out_error = JS_ThrowTypeError(ctx, "%s expects an array-like object", api_name);
        return false;
    }

    length_value = JS_PushGCRef(ctx, &length_ref);
    *length_value = JS_GetPropertyStr(ctx, value, "length");
    if (JS_IsException(*length_value) || !js_value_to_u32(ctx, *length_value, out_length)) {
        JS_PopGCRef(ctx, &length_ref);
        *out_error = JS_ThrowTypeError(ctx, "%s expects an array-like object with a numeric length", api_name);
        return false;
    }
    JS_PopGCRef(ctx, &length_ref);
    return true;
}

bool esp32_mquickjs_get_byte_source_chunk(JSContext *ctx,
                                          JSValue chunks,
                                          uint32_t index,
                                          const char *api_name,
                                          esp32_mquickjs_byte_source_chunk_t *out,
                                          JSValue *out_error)
{
    JSValue *value;

    if (out == NULL || out_error == NULL) {
        return false;
    }
    memset(out, 0, sizeof(*out));
    out->source.owner = JS_UNDEFINED;
    *out_error = JS_UNDEFINED;

    value = JS_AddGCRef(ctx, &out->value_ref);
    out->rooted = true;
    *value = JS_GetPropertyUint32(ctx, chunks, index);
    if (JS_IsException(*value)) {
        esp32_mquickjs_release_byte_source_chunk(ctx, out);
        *out_error = JS_EXCEPTION;
        return false;
    }

    if (!esp32_mquickjs_get_byte_source(ctx, *value, api_name, &out->source, &out->owned, out_error)) {
        esp32_mquickjs_release_byte_source_chunk(ctx, out);
        return false;
    }
    if (JS_GetClassID(ctx, *value) == JS_CLASS_BYTE_VIEW) {
        const uint8_t *leased_data = NULL;
        size_t leased_length = 0;

        if (!esp32_mquickjs_byte_view_acquire_read(
                ctx, *value, api_name, &leased_data, &leased_length)) {
            *out_error = JS_EXCEPTION;
            esp32_mquickjs_release_byte_source_chunk(ctx, out);
            return false;
        }
        out->source.data = leased_data;
        out->source.length = leased_length;
        out->read_leased = true;
    }
    return true;
}

void esp32_mquickjs_release_byte_source_chunk(JSContext *ctx,
                                              esp32_mquickjs_byte_source_chunk_t *chunk)
{
    if (chunk == NULL) {
        return;
    }
    if (chunk->read_leased && chunk->rooted) {
        esp32_mquickjs_byte_view_release_read(ctx, chunk->value_ref.val);
        chunk->read_leased = false;
    }
    esp32_mquickjs_release_byte_source(chunk->owned);
    chunk->owned = NULL;
    if (chunk->rooted) {
        JS_DeleteGCRef(ctx, &chunk->value_ref);
        chunk->rooted = false;
    }
    chunk->source.data = NULL;
    chunk->source.length = 0;
    chunk->source.owner = JS_UNDEFINED;
}

bool esp32_mquickjs_open_byte_span_source(JSContext *ctx,
                                          JSValue value,
                                          const char *api_name,
                                          esp32_mquickjs_byte_span_source_t *out,
                                          JSValue *out_error)
{
    esp32_mquickjs_byte_span_source_object_t *source;
    esp32_mquickjs_leased_byte_span_source_t *lease;

    if (out == NULL || out_error == NULL) {
        return false;
    }
    memset(out, 0, sizeof(*out));
    *out_error = JS_UNDEFINED;

    source = byte_span_source_from_value(ctx, value, api_name);
    if (source == NULL) {
        *out_error = JS_EXCEPTION;
        return false;
    }
    if (source->ops == NULL || source->ops->open == NULL) {
        *out_error = JS_ThrowTypeError(ctx, "%s received a ByteSpanSource without an opener", api_name);
        return false;
    }
    if (source->read_leases == UINT16_MAX) {
        *out_error = JS_ThrowInternalError(
            ctx, "%s could not acquire a ByteSpanSource read lease", api_name);
        return false;
    }
    lease = heap_caps_calloc(1, sizeof(*lease), MALLOC_CAP_8BIT);
    if (lease == NULL) {
        *out_error = JS_ThrowOutOfMemory(ctx);
        return false;
    }
    *JS_AddGCRef(ctx, &lease->owner_ref) = value;
    lease->owner_rooted = true;
    if (!source->ops->open(ctx, value, source->opaque, &lease->inner,
                           out_error)) {
        JS_DeleteGCRef(ctx, &lease->owner_ref);
        heap_caps_free(lease);
        return false;
    }
    if (lease->inner.next == NULL) {
        esp32_mquickjs_byte_span_source_close(ctx, &lease->inner);
        JS_DeleteGCRef(ctx, &lease->owner_ref);
        heap_caps_free(lease);
        *out_error = JS_ThrowInternalError(
            ctx, "%s received a ByteSpanSource without an iterator", api_name);
        return false;
    }
    source->read_leases++;
    lease->owner = source;
    out->opaque = lease;
    out->next = leased_byte_span_source_next;
    out->close = leased_byte_span_source_close;
    return true;
}

bool esp32_mquickjs_byte_span_source_known_length(JSContext *ctx,
                                                  JSValue value,
                                                  size_t *out_length)
{
    esp32_mquickjs_byte_span_source_object_t *source;

    if (out_length == NULL) {
        return false;
    }
    source = byte_span_source_from_value(ctx, value, "ByteSpanSource length");
    if (source == NULL || source->ops == NULL || source->ops->known_length == NULL) {
        return false;
    }
    *out_length = source->ops->known_length(source->opaque);
    return true;
}

void *esp32_mquickjs_byte_span_source_get_opaque(
    JSContext *ctx,
    JSValue value,
    const esp32_mquickjs_byte_span_source_object_ops_t *expected_ops,
    const char *api_name)
{
    esp32_mquickjs_byte_span_source_object_t *source =
        byte_span_source_from_value(ctx, value, api_name);

    if (source == NULL) {
        return NULL;
    }
    if (source->ops != expected_ops) {
        JS_ThrowTypeError(ctx, "%s expects an RPC file ByteSpanSource", api_name);
        return NULL;
    }
    return source->opaque;
}

JSValue esp32_mquickjs_new_byte_span_source(JSContext *ctx,
                                            JSValue owner,
                                            const esp32_mquickjs_byte_span_source_object_ops_t *ops,
                                            void *opaque)
{
    JSGCRef object_ref;
    JSGCRef owner_ref;
    JSValue *object;
    JSValue *rooted_owner;
    esp32_mquickjs_byte_span_source_object_t *source;
    int class_id;

    if (ops == NULL || ops->open == NULL) {
        if (ops != NULL && ops->destroy != NULL) {
            ops->destroy(ctx, opaque);
        }
        return JS_ThrowInternalError(ctx, "ByteSpanSource requires an open callback");
    }
    class_id = ops->class_id != 0 ? ops->class_id : JS_CLASS_BYTE_SPAN_SOURCE;
    if (class_id != JS_CLASS_BYTE_SPAN_SOURCE && class_id != JS_CLASS_BITMAP_SPAN_SOURCE) {
        if (ops->destroy != NULL) {
            ops->destroy(ctx, opaque);
        }
        return JS_ThrowInternalError(ctx, "ByteSpanSource received unsupported source class");
    }

    object = JS_PushGCRef(ctx, &object_ref);
    rooted_owner = JS_PushGCRef(ctx, &owner_ref);
    *object = JS_UNDEFINED;
    *rooted_owner = owner;
    *object = JS_NewObjectClassUser(ctx, class_id);
    if (JS_IsException(*object)) {
        if (ops->destroy != NULL) {
            ops->destroy(ctx, opaque);
        }
        JS_PopGCRef(ctx, &owner_ref);
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }

    source = heap_caps_malloc(sizeof(*source), MALLOC_CAP_8BIT);
    if (source == NULL) {
        if (ops->destroy != NULL) {
            ops->destroy(ctx, opaque);
        }
        JS_PopGCRef(ctx, &owner_ref);
        JS_PopGCRef(ctx, &object_ref);
        return JS_ThrowOutOfMemory(ctx);
    }
    source->ops = ops;
    source->opaque = opaque;
    source->read_leases = 0;
    source->closed = false;
    JS_SetOpaque(ctx, *object, source);

    if (!JS_IsUndefined(*rooted_owner) &&
        JS_IsException(JS_SetPropertyStr(ctx, *object, ESP32_MQUICKJS_BYTE_SPAN_SOURCE_OWNER_KEY, *rooted_owner))) {
        JS_SetOpaque(ctx, *object, NULL);
        if (ops->destroy != NULL) {
            ops->destroy(ctx, opaque);
        }
        heap_caps_free(source);
        JS_PopGCRef(ctx, &owner_ref);
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }

    JS_PopGCRef(ctx, &owner_ref);
    return JS_PopGCRef(ctx, &object_ref);
}

