99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_byte_source.c
JSValue esp32_mquickjs_new_owned_byte_view(JSContext *ctx,
                                           uint8_t *data,
                                           size_t length)
{
    if (data == NULL && length > 0) {
        return JS_ThrowInternalError(ctx, "ByteView data pointer is null");
    }
    return byte_view_make(ctx, data, length,
                          esp32_mquickjs_memory_payload_free,
                          data);
}

JSValue esp32_mquickjs_new_retained_byte_view(
    JSContext *ctx,
    const uint8_t *data,
    size_t length,
    esp32_mquickjs_byte_view_release_fn release,
    void *release_opaque)
{
    if ((data == NULL && length > 0) || release == NULL) {
        if (release != NULL) {
            release(release_opaque);
        }
        return JS_ThrowInternalError(
            ctx, "retained ByteView requires data and a release callback");
    }
    return byte_view_make(ctx, data, length, release, release_opaque);
}

bool esp32_mquickjs_byte_view_is_open(JSContext *ctx, JSValue value)
{
    esp32_mquickjs_byte_view_t *view;

    if (ctx == NULL || JS_GetClassID(ctx, value) != JS_CLASS_BYTE_VIEW) {
        return false;
    }
    view = JS_GetOpaque(ctx, value);
    return view != NULL && !view->closed;
}

bool esp32_mquickjs_byte_view_acquire_read(JSContext *ctx,
                                           JSValue value,
                                           const char *api_name,
                                           const uint8_t **out_data,
                                           size_t *out_length)
{
    esp32_mquickjs_byte_view_t *view;

    if (out_data == NULL || out_length == NULL) {
        return false;
    }
    view = byte_view_from_value(ctx, value, api_name);
    if (view == NULL) {
        return false;
    }
    if (view->read_leases == UINT16_MAX) {
        JS_ThrowInternalError(ctx, "%s could not acquire a ByteView read lease",
                              api_name);
        return false;
    }
    ++view->read_leases;
    *out_data = view->data;
    *out_length = view->length;
    return true;
}

void esp32_mquickjs_byte_view_release_read(JSContext *ctx, JSValue value)
{
    esp32_mquickjs_byte_view_t *view;

    if (JS_GetClassID(ctx, value) != JS_CLASS_BYTE_VIEW) {
        return;
    }
    view = JS_GetOpaque(ctx, value);
    if (view != NULL && view->read_leases != 0) {
        --view->read_leases;
        if (view->read_leases == 0 && view->closed) {
            JS_SetOpaque(ctx, value, NULL);
            byte_view_release(view);
            heap_caps_free(view);
        }
    }
}

void esp32_mquickjs_release_byte_source(uint8_t *owned)
{
    heap_caps_free(owned);
}

JSValue js_byte_view_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "ByteView cannot be constructed directly");
}

JSValue js_byte_span_source_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "ByteSpanSource cannot be constructed directly");
}

JSValue js_byte_view_close(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_byte_view_t *view;

    (void)argc;
    (void)argv;
    if (JS_GetClassID(ctx, *this_val) != JS_CLASS_BYTE_VIEW) {
        return JS_ThrowTypeError(ctx, "ByteView.close() expects a ByteView");
    }
    view = JS_GetOpaque(ctx, *this_val);
    if (view == NULL) {
        return JS_TRUE;
    }
    view->closed = true;
    if (view->read_leases == 0) {
        JS_SetOpaque(ctx, *this_val, NULL);
        byte_view_release(view);
        heap_caps_free(view);
    }
    return JS_TRUE;
}

JSValue js_byte_span_source_close(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_byte_span_source_object_t *source;
    int class_id;
    JSValue owner_result;

    (void)argc;
    (void)argv;
    class_id = JS_GetClassID(ctx, *this_val);
    if (class_id != JS_CLASS_BYTE_SPAN_SOURCE &&
        class_id != JS_CLASS_BITMAP_SPAN_SOURCE) {
        return JS_ThrowTypeError(ctx, "ByteSpanSource.close() expects a ByteSpanSource");
    }
    source = JS_GetOpaque(ctx, *this_val);
    if (source == NULL) {
        return JS_TRUE;
    }
    if (source->read_leases != 0) {
        return JS_ThrowInternalError(
            ctx, "ByteSpanSource.close() failed because the source is busy");
    }
    source->closed = true;
    if (source->ops != NULL && source->ops->destroy != NULL) {
        source->ops->destroy(ctx, source->opaque);
    }
    source->opaque = NULL;
    source->ops = NULL;
    owner_result = JS_SetPropertyStr(ctx, *this_val,
                                     ESP32_MQUICKJS_BYTE_SPAN_SOURCE_OWNER_KEY,
                                     JS_UNDEFINED);
    JS_SetOpaque(ctx, *this_val, NULL);
    heap_caps_free(source);
    return JS_IsException(owner_result) ? JS_EXCEPTION : JS_TRUE;
}

JSValue js_byte_span_source_get_length(JSContext *ctx,
                                       JSValue *this_val,
                                       int argc,
                                       JSValue *argv)
{
    size_t length = 0;

    (void)argc;
    (void)argv;
    if (!esp32_mquickjs_byte_span_source_known_length(ctx, *this_val, &length)) {
        if (JS_HasException(ctx)) {
            return JS_EXCEPTION;
        }
        return JS_NULL;
    }
    return JS_NewUint32(ctx, (uint32_t)length);
}

JSValue js_bitmap_span_source_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "BitmapSpanSource cannot be constructed directly");
}

void js_byte_view_finalizer(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_byte_view_t *view = opaque;

    (void)ctx;

    if (view == NULL) {
        return;
    }
    byte_view_release(view);
    heap_caps_free(view);
}

void js_byte_span_source_finalizer(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_byte_span_source_object_t *source = opaque;

    if (source == NULL) {
        return;
    }
    if (!source->closed && source->ops != NULL && source->ops->destroy != NULL) {
        source->ops->destroy(ctx, source->opaque);
    }
    source->closed = true;
    heap_caps_free(source);
}

JSValue js_byte_view_get_length(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_byte_view_t *view;

    (void)argc;
    (void)argv;

