99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_byte_source.c
    view = byte_view_from_value(ctx, *this_val, "ByteView.length");
    if (view == NULL) {
        return JS_EXCEPTION;
    }
    return JS_NewUint32(ctx, (uint32_t)view->length);
}

JSValue js_byte_view_get_uint8(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_byte_view_t *view;
    double raw_offset;
    uint32_t offset;

    view = byte_view_from_value(ctx, *this_val, "ByteView.getUint8()");
    if (view == NULL) {
        return JS_EXCEPTION;
    }
    if (argc != 1 || JS_ToNumber(ctx, &raw_offset, argv[0]) != 0 ||
        !isfinite(raw_offset) || raw_offset < 0 || raw_offset > UINT32_MAX ||
        (double)(uint32_t)raw_offset != raw_offset) {
        return JS_ThrowTypeError(ctx,
                                 "ByteView.getUint8(offset) expects a non-negative integer");
    }
    offset = (uint32_t)raw_offset;
    if ((size_t)offset >= view->length) {
        return JS_ThrowRangeError(ctx, "ByteView.getUint8() offset is out of range");
    }
    return JS_NewInt32(ctx, view->data[offset]);
}

JSValue js_byte_view_to_array(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_byte_view_t *view;
    JSGCRef array_ref;
    JSValue *array_obj;
    size_t i;

    (void)argc;
    (void)argv;

    view = byte_view_from_value(ctx, *this_val, "ByteView.toArray()");
    if (view == NULL) {
        return JS_EXCEPTION;
    }

    array_obj = JS_PushGCRef(ctx, &array_ref);
    *array_obj = JS_NewArray(ctx, 0);
    if (JS_IsException(*array_obj)) {
        JS_PopGCRef(ctx, &array_ref);
        return JS_EXCEPTION;
    }

    for (i = 0; i < view->length; ++i) {
        if (JS_IsException(JS_SetPropertyUint32(ctx, *array_obj, (uint32_t)i, JS_NewInt32(ctx, view->data[i])))) {
            JS_PopGCRef(ctx, &array_ref);
            return JS_EXCEPTION;
        }
    }

    return JS_PopGCRef(ctx, &array_ref);
}

JSValue js_bitmap_span_source_set_rect(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_byte_span_source_object_t *source;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;

    source = byte_span_source_from_value(ctx, *this_val, "BitmapSpanSource.setRect()");
    if (source == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 4 ||
        !js_value_to_i32(ctx, argv[0], &x) ||
        !js_value_to_i32(ctx, argv[1], &y) ||
        !js_value_to_i32(ctx, argv[2], &width) ||
        !js_value_to_i32(ctx, argv[3], &height)) {
        return JS_ThrowTypeError(ctx, "BitmapSpanSource.setRect(x, y, width, height) expects integers");
    }
    if (source->ops == NULL || source->ops->set_rect == NULL) {
        return JS_ThrowTypeError(ctx, "BitmapSpanSource.setRect() is not supported by this source");
    }
    if (source->read_leases != 0) {
        return JS_ThrowInternalError(
            ctx, "BitmapSpanSource.setRect() failed because the source is busy");
    }
    if (!source->ops->set_rect(ctx, source->opaque, x, y, width, height)) {
        return JS_EXCEPTION;
    }
    return *this_val;
}
